IDEA StatiCa Open Model
MessageNumber Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Message numbers
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[FlagsAttribute]
public enum MessageNumber
<FlagsAttribute>
Public Enumeration MessageNumber
[FlagsAttribute]
public enum class MessageNumber
Members
Member name | Value | Description
Unspecified | 0
Information | 16777216
Warning | 33554432
Error | 67108864
Reserved | 134217728
WarnNoPropertyInData | 33554433
WarnValueOutOfRange | 33554434
WarnCurveCount | 33554435
WarnReinforcementBarsCollision | 33554437
ErrNoOpenObject | 67108865
ErrDataObjectNotCreated | 67108866
ErrNoObjectInOpenModel | 67108867
ErrNoReferenceObjectInOpenModel | 67108868
ErrNoEquivalentObjectInDataModel | 67108869
ErrNoCrossSectionParameter | 67108870
ErrBoltsTooClose | 67108871
ErrBoltsTooCloseEdge | 67108872
ErrContactsAngle | 67108873
ErrIncorrentMaterialE | 67108874
ErrIncorrectMaterialEGP | 67108875
ErrPreloadedBoltGrade | 67108876
ErrValueOutOfRange | 67108877
ErrCurveZeroPoint | 67108878
ErrCurveFunction | 67108879
ErrCurveDecreaseFunction | 67108880
ErrCurveDerivation | 67108881
ErrCurveNotSet | 67108882
ErrValidPolyline | 67108883
ErrWarningLoad | 67108884
ErrTimeout | 67108885
ErrNoInLibrary | 67108886
See Also
Reference
IdeaRS.OpenModel.Message Namespace